--[[
    CardInfoDef.lua
    卡牌信息定义
    描述：卡牌信息定义
    编写：李昊
    修订：周星宇
    检查：张昊煜
]]
local CardInfoDef = {}

--[[
    id暂定
]]
CardInfoDef.CARD_ID = {
    CARD_1 = 1,
    CARD_2 = 2,
    CARD_3 = 3,
    CARD_4 = 4,
    CARD_5 = 5,
    CARD_6 = 6,
    CARD_7 = 7,
    CARD_8 = 8,
    CARD_9 = 9,
    CARD_10 = 10,
    CARD_11 = 11,
    CARD_12 = 12,
    CARD_13 = 13,
    CARD_14 = 14,
    CARD_15 = 15,
    CARD_16 = 16,
    CARD_17 = 17,
    CARD_18 = 18,
    CARD_19 = 19,
    CARD_20 = 20,
}


--[[
    名字暂定
]]
CardInfoDef.CARD_NAME = {
    CARD_1 = "001",
    CARD_2 = "002",
    CARD_3 = "003",
    CARD_4 = "004",
    CARD_5 = "005",
    CARD_6 = "006",
    CARD_7 = "007",
    CARD_8 = "008",
    CARD_9 = "009",
    CARD_10 = "010",
    CARD_11 = "011",
    CARD_12 = "012",
    CARD_13 = "013",
    CARD_14 = "014",
    CARD_15 = "015",
    CARD_16 = "016",
    CARD_17 = "017",
    CARD_18 = "018",
    CARD_19 = "019",
    CARD_20 = "020",
}

--[[
    种类升级对应所需卡片
]]
CardInfoDef.CARD_UPLEVEL_CARD = {
    NORMAL = {0,5,20,50,100,200,400,800,1000,2000,5000},
    RARE = {0,0,0,2,4,10,20,50,100,200,400,800,1000},
    EPIC = {0,0,0,0,0,2,4,10,20,50,100,200,400},
    LEGEND = {0,0,0,0,0,0,0,0,0,2,4,10,20}
}

--[[
    种类升级对应所需金币数量
]]
CardInfoDef.CARD_UPLEVEL_GOLD = {
    NORMAL = {0,5,20,50,150,400,1000,2000,4000,8000,20000,50000,100000},
    RARE = {0,0,0,50,150,400,1000,2000,4000,8000,20000,50000,100000},
    EPIC = {0,0,0,0,0,400,1000,2000,4000,8000,20000,50000,100000},
    LEGEND = {0,0,0,0,0,0,0,0,0,8000,20000,50000,100000}
}

--[[
    稀有度编号
]]
CardInfoDef.CARD_RAR = {
    NORMAL = 1,
    RARE = 2,
    LEGEND = 3,
    EPIC = 4,
}

--[[
    类型编号
]]
CardInfoDef.CARD_TYPE = {
    ATTACK = 1,
    INTERFERE = 2,
    ASSIST= 3,
    CONTROL = 4,
    CALL = 5
}

--[[
    攻击范围
]]
CardInfoDef.CARD_ATTACK_SCOPE = {
    FRONT = "前方",
    RAND = "随机敌人",
    MAX_LIFE= "最大血量",
}

--[[
    技能介绍
]]
CardInfoDef.CARD_SKILL_INTRO = {
    CARD_1 = "使被攻击目标得到“灼烧”状态。灼烧：造成两次额外伤害。",
    CARD_2 = "使星级数个怪物受到伤害。",
    CARD_3 = "攻击五次后，造成额外伤害。",
    CARD_4 = "攻击生命值最高的怪物，对BOSS造成双倍伤害。",
    CARD_5 = "每隔一段时间可以在三个形态之间切换，二形态攻速大幅度加强，三形态攻击必定暴击。",
    CARD_6 = "当场上有1，4，9个该种类防御塔时，攻速加强，同时造成额外伤害。",
    CARD_7 = "攻击时攻速获得提高。",
    CARD_8 = "每合成一次，获得攻击力加成。",
    CARD_9 = "攻击时有概率直接杀死怪物，对BOSS无效。",
    CARD_10 = "使被攻击目标得到“中毒”状态。中毒：每秒造成额外伤害。",
    CARD_11 = "合成时在对方玩家区域召唤一个特殊怪，使该区域的所有怪物加速。",
    CARD_12 = "对战开始时，随机选择一种敌方防御塔，获得其属性及技能。",
    CARD_13 = "合成时随机降低一个敌方防御塔的星级。",
    CARD_14 = "复制任意相同星级的防御塔。",
    CARD_15 = "合成或遭受攻击时获得能量。",
    CARD_16 = "生成一段时间后，变成星级加一的随机防御塔。",
    CARD_17 = "可以和任意相同星级的防御塔合成，不改变防御塔种类。",
    CARD_18 = "使被攻击目标得到”脆弱“状态。脆弱：受到伤害提高。",
    CARD_19 = "每隔一段时间使本方半场所有敌人减速。",
    CARD_20 = "使被攻击目标进入“混乱”状态。混乱：无法移动。",
}


return CardInfoDef
